---
kind: method
id: M:Autodesk.Revit.DB.Document.GetPrintSettingIds
zh: 文档、文件
source: html/81790544-e1d9-ebaa-037b-c2d12d2a6387.htm
---
# Autodesk.Revit.DB.Document.GetPrintSettingIds Method

**中文**: 文档、文件

Retrieves all Print Settings of current project.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetPrintSettingIds()
```

## Returns
The ElementIds of all print setting elements